// ====================== 2 变量声明、赋值语句(2.0~2.2) ======================

// 2.0 变量声明：两种形式(无类型推导 / 显式指定i32)
// 2.1 变量声明语句: let + 变量声明; 支持变量重影(重复声明隐藏旧绑定)

// 合法：显式类型变量声明
fn program_2_1__1() {
    let mut a:i32=0;
}

// 合法：无类型声明，后续赋值可推导为i32
fn program_2_1__2() { 
    let mut b;
    b=1; 
}

// 合法：变量重影(二次声明同名变量，隐藏旧绑定)
fn program_2_1__4() {
    let mut a:i32=0;
    a=1;
    let mut a:i32=0;
    a=2;
}

// 2.2 赋值语句：左值 = 表达式; 语义检查：变量声明、类型匹配、右值初始化

// 合法：给已声明可变变量赋值
fn program_2_2__1(mut a:i32) 
{
    a=32;
}

// 2.3 变量声明并赋值(拓展，非强制规则，附带示例)
fn program_2_3__1() { 
    let mut a:i32=1;
    let mut b=1;
}

// 合法：多次同名变量声明(重影)
fn program_2_3__2() {
    let mut a:i32=3; 
    let mut a=2;
    let mut a:i32=1;
}