// ====================== 3 表达式、运算、函数调用(3.1~3.5) ======================

// 3.1 基础表达式：常量、变量、括号嵌套表达式
fn program_3_1__1() {
    (1); 
    0;
    ((2)); 
    (((3)));
}

fn program_3_1__2(mut a:i32) 
{
    a;
    (a); 
    ((a));
    (((a)));
}

// 3.2 比较运算: < <= > >= == !=
fn program_3_2() {
    1<2;
    3<=4;
    5>6;
    7>=8;
    9==10;
    11!=12;
}

// 3.3 加减运算: + -
fn program_3_3() { 
    1+2;
    3-4;
}

// 3.4 乘除运算: * /
fn program_3_4() {
    1*2;
    3/4;
}

// 3.5 函数调用：实参数量、类型匹配；无返回值函数不能作为右值
// 无参函数定义
fn program_3_3__3__a() { }
fn program_3_3__1__a() { }
fn program_3_3__5__a() { }

// 带i32形参函数定义
fn program_3_3__4__a(mut a:i32) { }

// 合法：无参函数调用
fn program_3_3__1__b() {
    program_3_3__1__a();
}

// 合法：实参为表达式的函数调用
fn program_3_3__2__b() {
    program_3_3__4__a(1+2);
}