// ====================== 8 数组类型、数组访问(拓展) ======================

// 8.1 数组类型 [类型; 长度]
fn program_8_1() {
    let mut a:[i32;3]=[1,2,3];
    let mut b:[[i32;3];3]=[[1,2,3],[4,5,6],[7,8,9]];
}

// 合法：数组正常初始化
fn program_8_2__2() { 
    let mut a:[i32;3];
    a=[1,2,3]; 
}

// 8.3 数组元素访问
fn program_8_3__1(mut a: [[i32;3];3]) {
}

// 合法：数组元素参与运算
fn program_8_3__2(mut a:[i32;3]) 
{
    let mut b:i32=a[0]+a[1]+a[2]; 
}

// 合法：数组元素赋值、嵌套访问
fn program_8_3__3(mut a:[i32;3]) 
{
    let mut b:i32=a[0]; 
    a[0]=1; 
}