// ====================== 9 元组类型、元组访问(拓展) ======================

// 9.2 元组初始化
// 【语义错误】元组元素数量不匹配
fn program_9_2__1(mut a:i32) 
{
    let mut a:(i32,i32);
    a=(1,2,3);
}

// 【语义错误】元组元素类型不匹配
fn program_9_2__2() {
    let mut a:((),);
    a=(1,);
}

// 【语义错误】元组索引非数字
fn program_9_3__4() { 
    let mut a=(1,2,3);
    let mut b=a.a;
}

// 【语义错误】元组索引越界(长度3，下标0~2)
fn program_9_3__5() { 
    let mut a=(1,2,3);
    let mut b=a.3;
}

// 【语义错误】不可变元组禁止修改元素
fn program_9_3__6() {
    let a:(i32,i32,i32)=(1,2,3);
    a.0=4;
}